# RbsEnergyAnalysisSurfaceOriginY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisSurfaceOriginY Property
ParameterTypeId Class See Also
---
"Origin (Y)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceOriginY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceOriginY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace